In [2]:
import pandas as pd
import numpy as np

In [3]:
date=pd.read_csv('orders.csv')
time=pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with dates

In [8]:
# converting to datetime datatype

date['date']=pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## extract year

In [10]:
date['date_year']=date['date'].dt.year

In [11]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

In [12]:
# Extract months

date['date_month']=date['date'].dt.month

In [14]:
date.head()

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8
2 2018-10-23        1859       25       1       2018          10
3 2019-08-17        7292       25       1       2019           8
4 2019-01-06        4344       25       3       2019           1

In [15]:
date['date_month_name']=date['date'].dt.month_name()

In [16]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [18]:
# Extract days

date['date_days']=date['date'].dt.day

In [19]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [20]:
date['date_days_name']=date['date'].dt.day_name()

In [21]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_days_name
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday

In [22]:
# is weekend

date['is_weekend']=np.where(date['date_days_name'].isin(['Saturday','Sunday']),1,0)

In [24]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_days_name,is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1

In [26]:
# Extract week of the year

date['week_of_the_year']=date['date'].dt.isocalendar().week

In [28]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_days_name,is_weekend,week_of_the_year
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0,50
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0,33
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0,43
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1,33
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1,1

In [29]:
# Extract quarter

date['quarter_year']=date['date'].dt.quarter

In [30]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_days_name,is_weekend,week_of_the_year,quarter_year
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1,1,1

In [31]:
date['semester']=np.where(date['quarter_year'].isin([1,2]),1,2)

In [32]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_days_name,is_weekend,week_of_the_year,quarter_year,semester
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1,1,1,1

In [34]:
# Extract time elasped between dates

import datetime

today=datetime.datetime.today()

today

datetime.datetime(2025, 12, 24, 22, 17, 14, 523594)

In [35]:
today-date['date']

0     2206 days 22:17:14.523594
1     2688 days 22:17:14.523594
2     2619 days 22:17:14.523594
3     2321 days 22:17:14.523594
4     2544 days 22:17:14.523594
                 ...
995   2634 days 22:17:14.523594
996   2575 days 22:17:14.523594
997   2423 days 22:17:14.523594
998   2488 days 22:17:14.523594
999   2262 days 22:17:14.523594
Name: date, Length: 1000, dtype: timedelta64[ns]

In [36]:
(today-date['date']).dt.days

0      2206
1      2688
2      2619
3      2321
4      2544
       ...
995    2634
996    2575
997    2423
998    2488
999    2262
Name: date, Length: 1000, dtype: int64

In [40]:
np.round((today-date['date'])/np.timedelta64(30,'D'),0)

0      74.0
1      90.0
2      87.0
3      77.0
4      85.0
       ...
995    88.0
996    86.0
997    81.0
998    83.0
999    75.0
Name: date, Length: 1000, dtype: float64

In [41]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [42]:
time['date']=pd.to_datetime(time['date'])

In [44]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [46]:
time['hour']=time['date'].dt.hour
time['minute']=time['date'].dt.minute
time['sec']=time['date'].dt.second

In [48]:
time.head()

,date,msg,hour,minute,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [49]:
# Extract time part

time['time']=time['date'].dt.time

In [50]:
time.head()

,date,msg,hour,minute,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [51]:

today - time['date']

0     4392 days 21:27:14.523594
1     4256 days 22:37:14.523594
2     4742 days 21:56:14.523594
3     4044 days 21:46:14.523594
4     4441 days 23:06:14.523594
                 ...
995   5031 days 21:27:14.523594
996   4352 days 23:03:14.523594
997   4817 days 22:40:14.523594
998   4933 days 22:43:14.523594
999   4205 days 22:52:14.523594
Name: date, Length: 1000, dtype: timedelta64[ns]

In [52]:
(today - time['date'])/np.timedelta64(1,'s')

0      3.795460e+08
1      3.677998e+08
2      4.097878e+08
3      3.494800e+08
4      3.837856e+08
           ...
995    4.347556e+08
996    3.760958e+08
997    4.162704e+08
998    4.262930e+08
999    3.633943e+08
Name: date, Length: 1000, dtype: float64

In [53]:
(today - time['date'])/np.timedelta64(1,'m')

0      6.325767e+06
1      6.129997e+06
2      6.829796e+06
3      5.824666e+06
4      6.396426e+06
           ...
995    7.245927e+06
996    6.268263e+06
997    6.937840e+06
998    7.104883e+06
999    6.056572e+06
Name: date, Length: 1000, dtype: float64

In [54]:
(today - time['date'])/np.timedelta64(1,'h')

0      105429.454034
1      102166.620701
2      113829.937368
3       97077.770701
4      106607.104034
           ...
995    120765.454034
996    104471.054034
997    115630.670701
998    118414.720701
999    100942.870701
Name: date, Length: 1000, dtype: float64